; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image5 - mode
	image4 - mode
	thermograph3 - mode
	infrared2 - mode
	thermograph0 - mode
	thermograph1 - mode
	Star3 - direction
	GroundStation4 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image5)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(supports instrument2 thermograph1)
	(supports instrument2 image5)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 thermograph0)
	(supports instrument5 image5)
	(supports instrument5 thermograph3)
	(supports instrument5 image4)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star2)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Star9)
	(have_image Star5 infrared2)
	(have_image Planet6 thermograph3)
	(have_image Star7 image5)
	(have_image Star8 image5)
	(have_image Star9 image5)
	(have_image Star9 infrared2)
	(have_image Star10 thermograph0)
	(have_image Star10 image4)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 11
2. (calibrate satellite3 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 0 of 11
3. (turn_to satellite3 star7 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star7)
   goals met: 0 of 11
4. (take_image satellite3 star7 instrument5 image5)
   added: (have_image star7 image5)
   goals met: 1 of 11
5. (turn_to satellite3 planet6 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet6)
   goals met: 1 of 11
6. (turn_to satellite2 groundstation4 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 11
7. (turn_to satellite1 star1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star1)
   goals met: 3 of 11
8. (turn_to satellite0 groundstation4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 11
9. (take_image satellite3 planet6 instrument5 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 4 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
11. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 4 of 11
12. (turn_to satellite0 star5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star5)
   goals met: 4 of 11
13. (take_image satellite0 star5 instrument0 infrared2)
   added: (have_image star5 infrared2)
   goals met: 5 of 11
14. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 5 of 11
15. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   goals met: 6 of 11
16. (turn_to satellite3 star10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star10)
   goals met: 6 of 11
17. (take_image satellite3 star10 instrument5 image4)
   added: (have_image star10 image4)
   goals met: 7 of 11
18. (take_image satellite3 star10 instrument5 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 8 of 11
19. (turn_to satellite3 star8 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star8)
   goals met: 8 of 11
20. (take_image satellite3 star8 instrument5 image5)
   added: (have_image star8 image5)
   goals met: 9 of 11
21. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 10 of 11
22. (take_image satellite3 star9 instrument5 image5)
   added: (have_image star9 image5)
   goals met: 11 of 11
